from tabulate import tabulate
from task_2 import host_range_ping


def host_range_ping_tab():
    """
    Функция основана на функции из примера 2. Но в данном случае результат должен быть итоговым по всем ip-адресам,
    представленным в табличном формате (использовать модуль tabulate). Таблица должна состоять из двух колонок.
    """
    result_dict = host_range_ping()
    for key, item in result_dict.items():
        result_dict[key] = '\n'.join(item)
    print()
    print(tabulate([result_dict], headers='keys', tablefmt="orgtbl", stralign="center"))


if __name__ == "__main__":
    host_range_ping_tab()


"""
192.168.1.0 недоступен
192.168.1.1 недоступен
192.168.1.2 недоступен
192.168.1.3 недоступен
192.168.1.4 доступен
192.168.1.5 недоступен
192.168.1.6 недоступен
192.168.1.7 недоступен
192.168.1.8 недоступен
192.168.1.9 недоступен

|  Доступные узлы  |  Недоступные узлы  |
|------------------+--------------------|
|   192.168.1.4    |    192.168.1.0     |
|                  |    192.168.1.1     |
|                  |    192.168.1.2     |
|                  |    192.168.1.3     |
|                  |    192.168.1.5     |
|                  |    192.168.1.6     |
|                  |    192.168.1.7     |
|                  |    192.168.1.8     |
|                  |    192.168.1.9     |
"""